In [2]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [3]:
data={'names':names, 'woman':woman, 'ages': ages, 'country':country, 'education':education} 
data

{'names': ['Tomás', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'woman': [False, True, False, False, False, True],
 'ages': [32, 33, 28, 30, 32, 27],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [4]:
import pandas

In [5]:
students=pandas.DataFrame.from_dict(data)

In [6]:
from pandas import DataFrame as df

In [7]:
students=df.from_dict(data)
students

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [8]:
students[students.woman==False].sort_values('ages',ascending=False).tail(1).country

2    Spain
Name: country, dtype: object

In [12]:
students.where(students.woman==False)

   names  woman  ages country education
0  Tomás    0.0  32.0   Chile      Bach
1    NaN    NaN   NaN     NaN       NaN
2  Pablo    0.0  28.0   Spain    Master
3  Bjork    0.0  30.0  Norway       PhD
4   Alan    0.0  32.0    Peru      Bach
5    NaN    NaN   NaN     NaN       NaN

In [11]:
students.where(students.woman==False).ages.min()

28.0

In [13]:
minagemale= students.where(students.woman==False).ages.min()

In [14]:
students[students.ages==minagemale].country

2    Spain
Name: country, dtype: object

In [24]:
students.query("woman==False").ages.min()

28

In [26]:
minagemale2 =students.query("woman==False").ages.min()

In [27]:
students[students.ages==minagemale2].country

2    Spain
Name: country, dtype: object